In [2]:
# Run this cell if you are in Windows
import os
import pandas as pd

# Get the absolute path to the current notebook
os_path = os.getcwd()
# Add the extra path to the dataset file
dataset_path = os_path+'\datasets\Online_Retail.csv'
retail_data = pd.read_csv(dataset_path, encoding='ISO-8859-1')
retail_data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/11 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/11 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/11 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/11 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/11 12:50,4.95,12680.0,France

Example Dataframes

In [50]:
# Ejercicios con merge()
df1 = pd.DataFrame({"key": ["A", "B", "C"], "value1": [1, 2, 3]})
df2 = pd.DataFrame({"key": ["B", "C", "D"], "value2": [4, 5, 6]})

# Ejercicios con concat()
df3 = pd.DataFrame(
    {
        "Country": ["Japan", "Korea", "China"],
        "Capital": ["Tokyo", "Seoul", "Pekin"],
    }
)

df4 = pd.DataFrame(
    {
        "Country": ["England", "Ireland", "Scotland"],
        "Capital": ["London", "Dublin", "Edimburg"],
    }
)

# Ejercicios con join()
df5 = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

df6 = pd.DataFrame(
    {"C": ["C0", "C1", "C2"], "D": ["DO", "D1", "D2"]}, index=["K0", "K2", "K3"]
)

# Fusion DataFrames

The fusion in **Pandas DataFrames** is a key operation to combine data from different sources or **dataFrames**, the workflow is intended to be similar to the used to join table in **SQL**. There are many methods to merge and fusion data, th most common ones are `merge()`, `join()`, and `concat()`, there are more for more specific operations.

## Join DataFrames with `merge()`

The  `merge()` method is the most common to combine **DataFrames**. It offers many options of type *join* like: `inner`, `outer`, `left`, and `right`.

- **Inner join**: Returns the only the rows with matching correspondance in both DataFrames.
- **Left join**: Returns all the rows in the *left* DataFrame that match with the ones in the *right* DataFrame.
- **Right join**: Returns all the rows in the *right* DataFrame that match with the ones in the *left* DataFrame.
- **Outer join**: Return all the rows in both DataFrames, completing with `NaN` where there are no matches.

### DataFrames

In [19]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [20]:
df2

  key  value2
0   B       4
1   C       5
2   D       6

### Inner join

The inner join only merge the dataframe *key rows* that are common in both structures, and excludes the rest.

![alt text](media/inner1.png)

The result is a table with those common tables

![alt text](media/inner2.png)

In [21]:
inner_join = pd.merge(df1, df2, on='key', how='inner')
inner_join

  key  value1  value2
0   B       2       4
1   C       3       5

### Outer join

Outer join combines all coumns of both dataframes, the final table has $n + m$ columns, where $n$ is the quantity of columns in table 1 and $m$ is the number of columns in table 2:

![table highlight 1](media/outer1.png)

The rows with no matches ar completed with `NaN`:

![table higlighting different rows](media/outer2.png)

In [22]:
outer_join = pd.merge(df1, df2, on='key', how='outer')
outer_join

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     NaN     6.0

### Left and right join

The **right join** create a new table only with the key rows of the right table, if those rows doesn't exist in the left table, then the cell is completed with `NaN` values.

![alt text](media/right1.png)

![alt text](media/right2.png)

And the same applies to the **left join** options, just viceversa, only the *key rows* of the left table are kept.

![alt text](media/left1.png)

![alt text](media/left2.png)

In [23]:
left_merged = pd.merge(df1, df2, on='key', how='left')
right_merged = pd.merge(df1, df2, on='key', how='right')

print(left_merged, '\n\n', right_merged)

  key  value1  value2
0   A       1     NaN
1   B       2     4.0
2   C       3     5.0

   key  value1  value2
0   B     2.0       4
1   C     3.0       5
2   D     NaN       6

## Concat DataFrames with `concat()`

In [34]:
# Concatenate vertically
concat_0 = pd.concat([df3, df4])
concat_0

    Country   Capital
0     Japan     Tokyo
1     Korea     Seoul
2     China     Pekin
0   England    London
1   Ireland    Dublin
2  Scotland  Edimburg

In [35]:
# Concatenate horizontally
concat_1 = pd.concat([df3, df4], axis=1)
concat_1

  Country Capital   Country   Capital
0   Japan   Tokyo   England    London
1   Korea   Seoul   Ireland    Dublin
2   China   Pekin  Scotland  Edimburg

## Combine DataFrames based in the indexes using `join()`

The `join()` method is used to combine DataFrames using its indexes instead of assigning specific rows. This is useful when you have well defined custom indexes.

### DataFrames

In [52]:
df5

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [51]:
df6

     C   D
K0  C0  DO
K2  C1  D1
K3  C2  D2

In [55]:
join_0 = df5.join(df6)
join_0

     A   B    C    D
K0  A0  B0   C0   DO
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [56]:
join_inner = df5.join(df6, how='inner')
join_inner

     A   B   C   D
K0  A0  B0  C0  DO
K2  A2  B2  C1  D1

In [54]:
join_outer = df5.join(df6, how='outer')
join_outer

      A    B    C    D
K0   A0   B0   C0   DO
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2